{"modelTopology":{"class_name":"Model","config":{"name":"CapsNet","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"ReLU_Conv1","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[9,9],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"ReLU_Conv1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"PrimaryCaps","class_name":"PrimaryCaps","config":{"name":"PrimaryCaps","trainable":true,"capsule_dimension":8,"num_channels":1,"kernel_size":9,"strides":4},"inbound_nodes":[[["ReLU_Conv1",0,0,{}]]]},{"name":"DigitCaps","class_name":"DigitCaps","config":{"name":"DigitCaps","trainable":true,"num_capsules":10,"capsule_dimension":16,"routing_iterations":3},"inbound_nodes":[[["PrimaryCaps",0,0,{}]]]},{"name":"Decoder","class_name":"Sequential","config":{"name":"Decoder","layers":[{"class_name":"Mask","config":{"name":"MeskedDigitCaps","trainable":true,"batch_input_shape":[null,10,16],"dtype":"float32"}},{"class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"FC1_ReLU","trainable":true}},{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"FC2_ReLU","trainable":true}},{"class_name":"Dense","config":{"units":784,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"FC3_Sigmoid","trainable":true}},{"class_name":"Reshape","config":{"target_shape":[28,28,1],"name":"Reshape","trainable":true}}]},"inbound_nodes":[[["DigitCaps",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["DigitCaps",0,0],["Decoder",1,0]],"conv_options":{"filters":256,"kernel_size":9,"strides":1},"primary_caps_options":{"capsule_dimension":8,"num_channels":32,"kernel_size":9,"strides":2},"digit_caps_options":{"capsule_dimension":16,"num_capsules":10,"routing_iterations":3}},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./capsnet.weights.bin"],"weights":[{"name":"ReLU_Conv1/kernel","shape":[9,9,1,256],"dtype":"float32"},{"name":"ReLU_Conv1/bias","shape":[256],"dtype":"float32"},{"name":"PrimaryCaps/kernel","shape":[9,9,256,8],"dtype":"float32"},{"name":"PrimaryCaps/bias","shape":[8],"dtype":"float32"},{"name":"DigitCaps/weights","shape":[10,9,16,8],"dtype":"float32"},{"name":"FC1_ReLU/kernel","shape":[160,512],"dtype":"float32"},{"name":"FC1_ReLU/bias","shape":[512],"dtype":"float32"},{"name":"FC2_ReLU/kernel","shape":[512,1024],"dtype":"float32"},{"name":"FC2_ReLU/bias","shape":[1024],"dtype":"float32"},{"name":"FC3_Sigmoid/kernel","shape":[1024,784],"dtype":"float32"},{"name":"FC3_Sigmoid/bias","shape":[784],"dtype":"float32"}]}]}